virtualabs/cutcutgo/src/packs/ATSAMDA1J16B_DFP/pio/samda1j16b.h
#define PIN_PB10E_TC5_WO0                          _UL_(42)    
#define MUX_PB10E_TC5_WO0                          _UL_(4)     
#define PINMUX_PB10E_TC5_WO0                       ((PIN_PB10E_TC5_WO0 << 16) | MUX_PB10E_TC5_WO0)
#define PORT_PB10E_TC5_WO0                         (_UL_(1) << 10)

#define PIN_PB14E_TC5_WO0                          _UL_(46)    
#define MUX_PB14E_TC5_WO0                          _UL_(4)     
#define PINMUX_PB14E_TC5_WO0                       ((PIN_PB14E_TC5_WO0 << 16) | MUX_PB14E_TC5_WO0)
#define PORT_PB14E_TC5_WO0                         (_UL_(1) << 14)

#define PIN_PA25E_TC5_WO1                          _UL_(25)    
#define MUX_PA25E_TC5_WO1                          _UL_(4)     
#define PINMUX_PA25E_TC5_WO1                       ((PIN_PA25E_TC5_WO1 << 16) | MUX_PA25E_TC5_WO1)
#define PORT_PA25E_TC5_WO1                         (_UL_(1) << 25)

#define PIN_PB11E_TC5_WO1                          _UL_(43)    
#define MUX_PB11E_TC5_WO1                          _UL_(4)     
#define PINMUX_PB11E_TC5_WO1                       ((PIN_PB11E_TC5_WO1 << 16) | MUX_PB11E_TC5_WO1)
#define PORT_PB11E_TC5_WO1                         (_UL_(1) << 11)

#define PIN_PB15E_TC5_WO1                          _UL_(47)    
#define MUX_PB15E_TC5_WO1                          _UL_(4)     
#define PINMUX_PB15E_TC5_WO1                       ((PIN_PB15E_TC5_WO1 << 16) | MUX_PB15E_TC5_WO1)
#define PORT_PB15E_TC5_WO1                         (_UL_(1) << 15)

/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PB02E_TC6_WO0                          _UL_(34)    
#define MUX_PB02E_TC6_WO0                          _UL_(4)     
#define PINMUX_PB02E_TC6_WO0                       ((PIN_PB02E_TC6_WO0 << 16) | MUX_PB02E_TC6_WO0)
#define PORT_PB02E_TC6_WO0                         (_UL_(1) << 2)

#define PIN_PB16E_TC6_WO0                          _UL_(48)    
#define MUX_PB16E_TC6_WO0                          _UL_(4)     
#define PINMUX_PB16E_TC6_WO0                       ((PIN_PB16E_TC6_WO0 << 16) | MUX_PB16E_TC6_WO0)
#define PORT_PB16E_TC6_WO0                         (_UL_(1) << 16)

#define PIN_PB03E_TC6_WO1                          _UL_(35)    
#define MUX_PB03E_TC6_WO1                          _UL_(4)     
#define PINMUX_PB03E_TC6_WO1                       ((PIN_PB03E_TC6_WO1 << 16) | MUX_PB03E_TC6_WO1)
#define PORT_PB03E_TC6_WO1                         (_UL_(1) << 3)

#define PIN_PB17E_TC6_WO1                          _UL_(49)    
#define MUX_PB17E_TC6_WO1                          _UL_(4)     
#define PINMUX_PB17E_TC6_WO1                       ((PIN_PB17E_TC6_WO1 << 16) | MUX_PB17E_TC6_WO1)
#define PORT_PB17E_TC6_WO1                         (_UL_(1) << 17)

/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_PA20E_TC7_WO0                          _UL_(20)    
#define MUX_PA20E_TC7_WO0                          _UL_(4)     
#define PINMUX_PA20E_TC7_WO0                       ((PIN_PA20E_TC7_WO0 << 16) | MUX_PA20E_TC7_WO0)
#define PORT_PA20E_TC7_WO0                         (_UL_(1) << 20)

#define PIN_PB00E_TC7_WO0                          _UL_(32)    
#define MUX_PB00E_TC7_WO0                          _UL_(4)     
#define PINMUX_PB00E_TC7_WO0                       ((PIN_PB00E_TC7_WO0 << 16) | MUX_PB00E_TC7_WO0)
#define PORT_PB00E_TC7_WO0                         (_UL_(1) << 0)

#define PIN_PB22E_TC7_WO0                          _UL_(54)    
#define MUX_PB22E_TC7_WO0                          _UL_(4)     
#define PINMUX_PB22E_TC7_WO0                       ((PIN_PB22E_TC7_WO0 << 16) | MUX_PB22E_TC7_WO0)
#define PORT_PB22E_TC7_WO0                         (_UL_(1) << 22)

#define PIN_PA21E_TC7_WO1                          _UL_(21)    
#define MUX_PA21E_TC7_WO1                          _UL_(4)     
#define PINMUX_PA21E_TC7_WO1                       ((PIN_PA21E_TC7_WO1 << 16) | MUX_PA21E_TC7_WO1)
#define PORT_PA21E_TC7_WO1                         (_UL_(1) << 21)

#define PIN_PB01E_TC7_WO1                          _UL_(33)    
#define MUX_PB01E_TC7_WO1                          _UL_(4)     
#define PINMUX_PB01E_TC7_WO1                       ((PIN_PB01E_TC7_WO1 << 16) | MUX_PB01E_TC7_WO1)
#define PORT_PB01E_TC7_WO1                         (_UL_(1) << 1)

#define PIN_PB23E_TC7_WO1                          _UL_(55)    
#define MUX_PB23E_TC7_WO1                          _UL_(4)     
#define PINMUX_PB23E_TC7_WO1                       ((PIN_PB23E_TC7_WO1 << 16) | MUX_PB23E_TC7_WO1)
#define PORT_PB23E_TC7_WO1                         (_UL_(1) << 23)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PA04E_TCC0_WO0                         _UL_(4)     
#define MUX_PA04E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PA04E_TCC0_WO0                      ((PIN_PA04E_TCC0_WO0 << 16) | MUX_PA04E_TCC0_WO0)
#define PORT_PA04E_TCC0_WO0                        (_UL_(1) << 4)

#define PIN_PA08E_TCC0_WO0                         _UL_(8)     
#define MUX_PA08E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PA08E_TCC0_WO0                      ((PIN_PA08E_TCC0_WO0 << 16) | MUX_PA08E_TCC0_WO0)
#define PORT_PA08E_TCC0_WO0                        (_UL_(1) << 8)

#define PIN_PB30E_TCC0_WO0                         _UL_(62)    
#define MUX_PB30E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PB30E_TCC0_WO0                      ((PIN_PB30E_TCC0_WO0 << 16) | MUX_PB30E_TCC0_WO0)
#define PORT_PB30E_TCC0_WO0                        (_UL_(1) << 30)

#define PIN_PA05E_TCC0_WO1                         _UL_(5)     
#define MUX_PA05E_TCC0_WO1                         _UL_(4)     
#define PINMUX_PA05E_TCC0_WO1                      ((PIN_PA05E_TCC0_WO1 << 16) | MUX_PA05E_TCC0_WO1)
#define PORT_PA05E_TCC0_WO1                        (_UL_(1) << 5)

#define PIN_PA09E_TCC0_WO1                         _UL_(9)     
#define MUX_PA09E_TCC0_WO1                         _UL_(4)     
#define PINMUX_PA09E_TCC0_WO1                      ((PIN_PA09E_TCC0_WO1 << 16) | MUX_PA09E_TCC0_WO1)
#define PORT_PA09E_TCC0_WO1                        (_UL_(1) << 9)

